const data = [
  [
    {
      title: 'Аюнда Рису',
      desc: 'Аюнда Рису - очаровательная белка из Hololive ID, которая всегда готова весело провести время с фанатами. Она известна своей бесконечной энергией и радостью, которую она приносит во время стримов.',
      img: 'images/Risu.png',
      fullImg: 'images/RisuFull.png',
      text: `
      Аюнда Рису (Ayunda Risu) - очаровательная и жизнерадостная виртуальная айдолка из группы Hololive ID. Своим неподдельным весельем и харизмой она завоевала сердца многих поклонников по всему миру.
      <br><br>
      Рису является мастером развлекательных стримов, где она с легкостью переключается между игровыми сессиями, музыкальными выступлениями и общением со своими зрителями. Ее энергия и позитив всегда приносят радость и улыбки тем, кто находится в ее виртуальной компании.
      <br><br>
      Особенностями Рису являются ее музыкальные таланты и способность к исполнению различных музыкальных жанров. Она регулярно проводит концерты, на которых исполняет песни разных стилей, и ее музыкальные выступления всегда приносят восторг и вдохновение.
      <br><br>
      Среди других ее интересов - игровая культура и общение с фанатами. Рису активно участвует в видеоиграх и демонстрирует свои игровые навыки во время стримов. Она также любит проводить разнообразные интерактивные мероприятия и конкурсы, чтобы поддержать и радовать свое сообщество.
      <br><br>
      Аюнда Рису - это яркий пример виртуального айдола, который с легкостью сочетает в себе музыкальные, развлекательные и игровые аспекты, создавая веселое и дружелюбное пространство для своих поклонников. Ее харизматичная личность и несравненные таланты делают ее одной из любимых звезд Hololive ID и привлекают внимание и восхищение фанатов по всему миру.
      `,
    },
    {
      title: 'Муна Хошинова',
      desc: 'Муна Хошинова - яркая и очаровательная виртуальная айдол, представитель Hololive ID. Она обладает уникальным стилем и обаянием, которые непременно привлекут ваше внимание.',
      img: 'images/Moona.png',
      fullImg: 'images/MoonaFull.png',
      text: `
      Муна Хошинова (Muna Hoshinova) - это яркая и чрезвычайно энергичная виртуальная айдолка, представительница группы Hololive ID. С ее неподражаемым стилем и восхитительным обаянием она сразу же привлекла внимание аудитории и завоевала сердца множества поклонников.
      <br><br>
      Муна славится своими креативными стримами, где она может исполнять песни, играть в видеоигры, общаться со своими зрителями и проводить разнообразные интересные мероприятия. Ее энергия и позитив всегда поднимают настроение и приносят веселье тем, кто находится в ее виртуальной компании.
      <br><br>
      Особенностью Муны является ее музыкальный талант. Она часто исполняет песни разных жанров и демонстрирует свой вокальный диапазон на стримах и концертах. Ее музыкальные выступления часто сопровождаются яркими костюмами и визуальными эффектами, что делает их поистине незабываемыми.
      <br><br>
      Помимо музыки и развлечений, Муна активно взаимодействует с аудиторией и создает дружелюбное и веселое сообщество. Она обладает способностью легко устанавливать контакт со своими зрителями и делает все возможное, чтобы поддержать и вдохновить их.
      <br><br>
      Муна Хошинова - это веселая и талантливая виртуальная айдолка, которая умело сочетает в себе музыкальные и развлекательные аспекты, принося радость и позитив своим многочисленным поклонникам. Ее яркая личность и творческий подход делают ее одной из звезд Hololive ID и символом радости и развлечения для аудитории по всему миру.
      `,
    },
    {
      title: 'Айрани Иофифтин',
      desc: 'Айрани Иофифтин - загадочная и талантливая виртуальная айдолка из Hololive ID. Она славится своими потрясающими навыками в области искусства, особенно рисованием и рукоделием.',
      img: 'images/Airani.png',
      fullImg: 'images/AiraniFull.png',
      text: `Айрани Иофифтин (Airani Iofifteen) - загадочная и талантливая виртуальная айдолка из Hololive ID, олицетворяющая креативность и мистический шарм. Ее уникальные арт-стримы и творческие выступления делают ее одной из наиболее узнаваемых фигур в мире виртуальных айдолов.
      <br><br>
      Основным моментом в творчестве Айрани является искусство. Она проявляет свой талант в рисовании и рукоделии, и часто на ее стримах можно увидеть ее создание удивительных и красочных произведений искусства. Это делает ее стримы интересными и вдохновляющими для ее зрителей, а также позволяет поддерживать связь с творческим сообществом.
      <br><br>
      Айрани также известна своей загадочной аурой. Она создает уникальную и мистическую атмосферу на своих стримах, что придает ей неповторимый характер среди айдолов. Ее способность погружать аудиторию в мир фантазии и вдохновлять на творчество делает ее поистине особенной.
      <br><br>
      Кроме этого, Айрани активно взаимодействует с аудиторией, общается со своими поклонниками и создает теплую и дружелюбную обстановку в своем сообществе. Ее мистический образ сочетается с открытостью и приветливостью, что делает ее очаровательной и доступной айдолкой.
      <br><br>
      Айрани Иофифтин - это виртуальная айдолка, которая воплощает творчество и загадку. Ее стримы и искусство продолжают вдохновлять и радовать ее зрителей, а ее уникальная личность делает ее одной из самых ярких и интересных фигур в мире Hololive ID.
      `,
    },
  ],
  [
    {
      title: 'Олли Курейджи',
      desc: 'Олли - виртуальный зомби-айдол из Hololive ID с яркой личностью и заразительным чувством юмора. Она часто шутит на свой счет и весело общается с аудиторией, создавая атмосферу радости.',
      img: 'images/Ollie.png',
      fullImg: 'images/OllieFull.png',
      text: `Олли Курейджи (Ollie Kureiji) - живая, яркая и веселая виртуальная айдолка из группы Hololive ID, которая сразу же привлекла внимание своим чувством юмора и непосредственностью. Ее личность полна энергии, и она всегда готова подарить своим поклонникам порцию радости и позитива.
      <br><br>
      Олли часто шутит на свой счет и создает комические моменты на своих стримах. Ее чувство юмора и спонтанность делают каждый из ее стримов интересным и забавным для аудитории. Она также проявляет талант в актерской игре и часто устраивает различные сценические выступления, где она может весело воплощать разные роли.
      Олли не только развлекатель, но и талантливый певец. Она исполняет разнообразные песни на своих стримах и концертах, и ее вокальные выступления всегда приносят радость и восторг ее зрителям. Ее энергия и позитив не знают границ, что делает ее одной из любимых айдолов в сообществе Hololive.
      <br><br>
      Кроме того, Олли активно взаимодействует с аудиторией, общается со своими поклонниками и создает дружелюбную атмосферу в своем сообществе. Ее непринужденность и искренность делают ее очаровательной и доступной для своих зрителей.
      <br><br>
      Олли Курейджи - это виртуальная айдолка, которая своим чувством юмора и творчеством приносит радость и вдохновение своим многочисленным поклонникам. Ее стримы и выступления всегда наполняются энергией и позитивом, что делает ее одной из наиболее замечательных айдолов Hololive ID.`,
    },
    {
      title: 'Аня Мелфисса',
      desc: 'Аня - загадочная и атмосферная виртуальная айдолка из Hololive ID, которая создает уникальные и захватывающие стримы. Ее контент часто имеет фантастическую тематику.',
      img: 'images/Anya.png',
      fullImg: 'images/AnyaFull.png',
      text: `Аня Мелфисса (Any Melfissa) - это загадочная и магическая виртуальная айдолка из Hololive ID, которая приносит в мир виртуальных айдолов долю фэнтези и феерии. Ее стримы и выступления создают ощущение путешествия в удивительный мир волшебства и фантазии.
      <br><br>
      Аня специализируется на фэнтезийных темах и часто проводит стримы с магической атмосферой. Она создает уникальные миры внутри своих выступлений, объединяя в себе игровой процесс, вокал и визуальные эффекты. Ее контент погружает зрителей в магические приключения, где они могут наслаждаться фантазией и приключениями.
      <br><br>
      Однако Аня также активно участвует в игровой культуре и играет в различные видеоигры на своих стримах. Ее игровые сессии всегда интересны и увлекательны, и она весело общается с аудиторией, делясь впечатлениями и комментариями.
      <br><br>
      Своей загадочной аурой и атмосферой фэнтези Аня Мелфисса создает уникальное и интересное пространство для своих поклонников. Она является мастером в создании магических моментов и сказочных историй, что делает ее одной из наиболее уникальных айдолов Hololive ID.
      <br><br>
      Кроме этого, Аня активно взаимодействует с аудиторией, поддерживает дружелюбную обстановку и создает теплые и позитивные отношения с ее зрителями. Ее творческая и загадочная натура делают ее одной из самых завораживающих фигур виртуального мира айдолов.`,
    },
    {
      title: 'Рейне Паволия',
      desc: 'Рейне - талантливая виртуальная айдолка из Hololive ID с изящной и грациозной манерой общения. Она является певицей и исполнительницей собственных песен, что придает ей особую нотку элегантности.',
      img: 'images/Reine.png',
      fullImg: 'images/ReineFull.png',
      text: `Рейне Паволия (Reine Pavolia) - это талантливая и очаровательная
      виртуальная айдолка, входящая в состав Hololive ID. Ее
      исключительный талант и уникальная личность сделали ее одной из
      наиболее замечательных и любимых айдолов в сообществе. <br /><br />
      Рейне обладает невероятным вокальным даром и исполнительской
      мастерством, что делает ее концерты и выступления невероятно
      красочными и запоминающимися. Она часто исполняет собственные песни,
      которые впечатляют слушателей своей глубиной и эмоциональностью.
      <br /><br />
      Она также активно участвует в мире видеоигр, играя в разнообразные
      игры на своих стримах и подарив зрителям уникальные и захватывающие
      игровые моменты. Рейне обладает способностью создавать особую
      атмосферу на своих стримах, благодаря своей чувствительной и милой
      натуре. <br /><br />
      Кроме этого, Рейне Паволия часто взаимодействует с аудиторией,
      общается со своими поклонниками и создает теплую и дружелюбную
      обстановку в своем сообществе. Ее милосердие и открытость делают ее
      одной из самых пригласительных и доступных айдолов, что укрепляет
      связь с ее поклонниками. <br /><br />
      В общем, Рейне Паволия - это айдол, который умеет приносить радость
      и вдохновение своим талантом, энергией и прекрасной личностью. Ее
      стримы и выступления всегда наполняются теплыми и позитивными
      эмоциями, что делает ее одной из ярких звезд виртуального мира
      Hololive.`,
    },
  ],
  [
    {
      title: 'Вестия Зета',
      desc: 'Зета - милосердная и добрая виртуальная айдолка из Hololive ID. Ее контент часто олицетворяет нежность и заботу, и она всегда готова подарить тепло и уют своим зрителям. ',
      img: 'images/Zeta.png',
      fullImg: 'images/ZetaFull.png',
      text: `Вестия Зета (Vestia Zeta) - это обаятельная и добросердечная виртуальная айдолка, которая является членом группы Hololive ID. Ее виртуальный облик и личность сразу же привлекают внимание, и она стала любимицей многих поклонников благодаря своей теплой и уютной атмосфере.
      <br><br>
      Основным характерным чертой Вестии является ее доброта и забота. Она всегда стремится создать вокруг себя позитивное и уютное пространство для своих зрителей. Ее стримы и выступления наполнены нежностью и теплотой, и она старается подарить радость каждому, кто находится в ее виртуальной компании.
      <br><br>
      Вестия также обладает музыкальными талантами и часто исполняет песни на своих стримах. Ее вокальное исполнение приносит восторг и вдохновение, а ее песни звучат как утренний зефир, принося тепло и радость.
      <br><br>
      Она не только милосердна и музыкально одарена, но и активно взаимодействует с аудиторией. Она любит общаться со своими зрителями, отвечать на их вопросы и создавать дружественную и дружелюбную обстановку в своем сообществе.
      <br><br>
      Вестия Зета - это виртуальная айдолка, которая смогла привнести свою уникальную нотку тепла и заботы в мир Hololive ID. Ее добросердечность и увлеченность песнями делают ее одной из ярких звезд виртуальной айдол-индустрии.`,
    },
    {
      title: 'Каела Ковалскиа',
      desc: 'Каела - талантливая и креативная виртуальная айдолка, член Hololive ID, которая специализируется на искусстве и творчестве.',
      img: 'images/Kaela.png',
      fullImg: 'images/KaelaFull.png',
      text: `Каела Ковалскиа (Kaela Kovalskia) - талантливая и вдохновляющая виртуальная айдолка из группы Hololive ID, чья творческая энергия и художественные способности ошеломляют ее поклонников. Ее искусство является неотъемлемой частью того, что делает ее такой уникальной и популярной фигурой в виртуальном мире.
      <br><br>
      Каела проявляет свой талант в рисовании и других формах искусства. Ее стримы посвящены творчеству, где она создает потрясающие арт-произведения и делится своим художественным процессом со зрителями. Она вдохновляет своих поклонников на творчество, показывая, как талант и страсть могут оживить цифровое полотно.
      <br><br>
      Каела также общительна и тепла в общении с аудиторией. Она любит разговаривать со своими зрителями, отвечать на их вопросы и делиться своими историями и переживаниями. Ее искренность и поддержка укрепляют связь между ней и ее поклонниками.
      <br><br>
      Кроме того, Каела способна создавать особую атмосферу на своих стримах, что делает их интересными и увлекательными. Ее страсть к искусству и ее способность поделиться этой страстью с миром делают ее вдохновляющей фигурой для своего сообщества и за ее пределами.
      <br><br>
      Каела Ковалскиа - это талантливая художница и каризматичная личность, которая приносит красоту и вдохновение своим творчеством. Ее участие в сообществе Hololive ID обогащает его и делает мир виртуальных айдолов более ярким и увлекательным.`,
    },
    {
      title: 'Кобо Канаеру',
      desc: 'Кобо Канаеру - яркая и динамичная виртуальная айдолка, чьи стримы часто заполняются веселыми игровыми сессиями.',
      img: 'images/Kobo.png',
      fullImg: 'images/KoboFull.png',
      text: `Кобо Канаеру (Kobo Kanearu) - это энергичная и веселая виртуальная айдолка из группы Hololive ID, чьи стримы и выступления всегда наполняются позитивом и весельем. Ее жизнерадостный характер и харизма привлекают внимание множества поклонников.
      <br><br>
      Одной из ключевых черт Кобо является ее игровой талант. Она активно играет в различные видеоигры на своих стримах и часто демонстрирует свои навыки и комический подход к играм. Ее стримы полны смеха и веселья, и она всегда готова подарить хорошее настроение своим зрителям.
      <br><br>
      Кобо также известна своими креативными мероприятиями и интерактивными шоу. Она создает уникальные форматы стримов, где взаимодействует с аудиторией и устраивает конкурсы и мини-игры, вовлекая своих зрителей в процесс.
      <br><br>
      Ее обаяние и комический талант делают ее одной из любимых айдолов среди поклонников Hololive ID. Она обладает способностью развлечь и поднять настроение даже в самый серый день.
      <br><br>
      Кобо Канаеру - это айдолка, которая приносит смех и радость своим зрителям. Ее энергия и позитив всегда вдохновляют и создают атмосферу праздника на ее стримах и выступлениях.`,
    },
  ],
];

const cards = document.getElementById('cards');
const popup = document.getElementById('popup');
const popupContent = document.getElementById('popupContent');

let selected = 'Все';

popup.addEventListener('click', () => {
  popup.style.opacity = 0;
  setTimeout(() => {
    popup.style.display = 'none';
  }, 400);
});

popupContent.addEventListener('click', (e) => {
  e.stopPropagation();
});

function showPopup(gen, id) {
  popup.style.display = 'flex';
  setTimeout(() => {
    popup.style.opacity = 1;
  }, 25);
  popupContent.innerHTML = `
  <img src="${data[gen][id].fullImg}" />
  <div class="desc">
    <h1>${data[gen][id].title}</h1>
    <p>
      ${data[gen][id].text}
    </p>
  </div>
  `;
}

function renderSelected(elem) {
  selected = elem.textContent.trim();

  document.querySelector(
    '.item[data-selected="true"]'
  ).dataset.selected = false;

  elem.dataset.selected = true;

  let content = '';

  for (let gen = 0; gen < data.length; gen++) {
    if (
      elem.dataset.value !== 'all' &&
      gen + 1 !== Number(elem.dataset.value)
    ) {
      continue;
    }

    const list = data[gen];

    for (let i = 0; i < list.length; i++) {
      const obj = list[i];

      content += `
      <div class="item" onclick='showPopup(${gen}, ${i})'">
        <img src="${obj.img}" alt="Аюнда Рису" />
        <div class="group">
          <div class="subgroup">
            <h2>${obj.title}</h2>
            <span>${gen + 1} поколение</span>
          </div>
          <p>
            ${obj.desc}
          </p>
        </div>
      </div>
      `;
    }
  }

  cards.style.opacity = 0;
  setTimeout(() => {
    cards.innerHTML = content;
    cards.style.opacity = 1;
  }, 300);
}

renderSelected(document.querySelector('.item[data-selected="true"]'));
